# Importing necessary libraries
import re
import ast
import time
import math
import numpy as np
import pandas as pd
import datetime
import pickle

from geopy.distance import geodesic


import requests
import json





#---------------------------------------------------------
# Function for Geocoding Addresses using the 2GIS API
#---------------------------------------------------------
def geocode_2gis(address):
    '''
    Description:
    Performs geocoding of an address using the 2GIS API to retrieve latitude and longitude coordinates. 
    It constructs a URL with the provided address, sends a GET request to the 2GIS API, 
    and parses the response to extract the coordinates.

    Arguments:
        - address (str): The address to be geocoded.

    Returns:
        str or None: A string containing latitude and longitude coordinates in the format "(latitude, longitude)"
        if the geocoding is successful, otherwise None.
    '''
    
    address = address + ", Астана"
    api_key = '768ac379-04fb-4f9e-a775-959e3e2bc30b'
    url = f'https://catalog.api.2gis.com/3.0/items/geocode?q={address}&fields=items.point&key={api_key}'

    try:
        response = requests.get(url)
        response.raise_for_status()  # Raise an error for bad response status
        data = response.json()

        if 'result' in data:
            result = data['result']
            if result['total'] > 0:
                item = result['items'][0]
                coordinates = item['point']
                return f"({coordinates['lat']}, {coordinates['lon']})"
    except (requests.RequestException, json.JSONDecodeError) as e:
        print(f"Error fetching or decoding JSON: {e}")
    return None



#-----------------------------------------------------------------------------------------
# Dictionaries for Functions that calculate or check places based on complex coordinates 
#-----------------------------------------------------------------------------------------

schools_coord_dict = {
    'Бәсіре переулок, 2, 2 этаж': (51.185095, 71.330193),
    'Ақкербез, 10': (51.148614, 71.408842),
    'Бөгенбай батыр проспект, 32/2, 2 этаж': (51.174351, 71.40896),
    'Озбек Али Жаныбек, 30, 2 этаж': (51.133087, 71.51445),
    'Жаһанша Досмұхамедұлы, 2': (51.180906, 71.47141),
    'Бориса Ерзаковича, 20, 2 этаж': (51.180223, 71.367633),
    'Сарайшық, 7/1': (51.136013, 71.428764),
    'Е-624, 8': (51.03923, 71.430131),
    'Кенен Әзірбаев, 39, 2 этаж': (51.126429, 71.494442),
    'Майлина, 16/3': (51.144977, 71.475581),
    'Асқар Тоқпанов, 40, 3 этаж': (51.145374, 71.451735),
    'Иманова, 40, 2 этаж': (51.161506, 71.453804),
    'А 135, 7, 2 этаж': (51.124163, 71.611552),
    'Қамысты, 7, 2 этаж': (51.199447, 71.454819),
    'Халел Досмұхамедұлы, 51': (51.139449, 71.421282),
    'Әміре Қашаубаев, 28, 1 этаж': (51.11551, 71.243237),
    'Маяковского, 3/2, 2 этаж': (51.145683, 71.56385),
    'Айғаным, 2': (51.139438, 71.403665),
    'Кенесары, 93/1, 2 этаж': (51.162751, 71.467509),
    'Шығанақ, 7, 3 этаж': (51.158387, 71.406872),
    'Евгения Брусиловского, 4/3, 2 этаж': (51.160311, 71.456362),
    'Қараменде би Шақаулы, 5/1, 2 этаж': (51.17231, 71.369181),
    'Егемен Қазақстан, 10, 2 этаж': (51.169768, 71.455007),
    '247-я, 2, 2 этаж': (51.112273, 71.649066),
    'Абай проспект, 86/1, 2 этаж': (51.164434, 71.463859),
    '50/3, 2 этаж': (51.11153, 71.41429),
    'Жумабека Ташенова, 9/4, 2 этаж; 2 корпус': (51.154049, 71.440049),
    'Телжан Шонанұлы, 47, 2 этаж': (51.196118, 71.432177),
    'Түркістан, 12/1, 2 этаж': (51.110774, 71.428313),
    'Қошке Кемеңгерұлы, 10а, 2 этаж': (51.206681, 71.397385),
    'А-98, 2, 2 этаж': (51.124048, 71.489445),
    'Бейбітшілік, 75а, 2 этаж': (51.187009, 71.413827),
    'Айбырая Алтынсарина, Абай Кұнанбайұлы, 31, 2 этаж': (51.247942, 71.252027),
    'Николая Хлудова, 1/1, 2 этаж': (51.146464, 71.433921),
    'Карасай батыра, 31/2': (51.199053, 71.389208),
    'Алии Молдагуловой, 21': (51.091408, 71.721893),
    'Ардагерлер, 13, 2 этаж': (51.182051, 71.341128),
    'Иманжүсiп Құтпанов, 16а, 2 этаж': (51.191849, 71.415625),
    'Малика Габдуллина, 8, 2 этаж': (51.160025, 71.433806),
    'Шонанулы, 45': (51.195977, 71.431179),
    'Әліби Жангелдин, 1, 2 этаж': (51.173111, 71.408391),
    'Иманак, 9/1, 2 этаж': (51.150242, 71.56218),
    'Абылай Хана проспект, 8/1, 2 этаж; 1 корпус': (51.158037, 71.472773),
    'Мәскеу, 38, 2 этаж': (51.182142, 71.418538),
    'Александра Затаевича, 9/7, 2 этаж': (51.188962, 71.402823),
    'Бейімбет Майлин, 3/1, 3 этаж': (51.143339, 71.464115),
    'Әліби Жангелдин, 28, 3 этаж': (51.173492, 71.421442),
    'Кенен Әзірбаев, 41, 2 этаж': (51.12692, 71.496183),
    'Ахмета Жубанова, 2, 3 этаж': (51.158091, 71.457946),
    '38-я, 2, 2 этаж': (51.101383, 71.455812),
    'Петрова, 3/1, 2 этаж': (51.150933, 71.462947),
    'Орынбор, 20, 2 этаж': (51.106277, 71.439497),
    'Сарытогай, 9, 2 этаж': (51.043686, 71.426601),
    'Степана Кубрина, 22/1': (51.170427, 71.404754),
    'Сырым батыр, 105, 2 этаж': (51.128878, 71.252357),
    'Кенен Әзірбаев, 2/1, 2 этаж': (51.12714, 71.505779),
    'Дінмұхамед Қонаев, 35': (51.130544, 71.436021),
    '638-я, 2, 3 этаж': (51.135472, 71.288601),
    'Абылай Хана проспект, 23/1, 2 этаж': (51.157355, 71.4857),
    'Абай проспект, 17, 1 этаж': (51.166813, 71.41115),
    'Республики проспект, 12/5, 2 этаж': (51.161856, 71.43043),
    'Міржақып Дулатов, 176/1, 2 этаж': (51.205199, 71.366701),
    '37 переулок, 3/1': (51.145961, 71.496347),
    'Ақан сері, 42/3, 2 этаж': (51.183476, 71.375421),
    'Әлия Молдағұлова, 35': (51.18713, 71.418162),
    'Мәскеу, 28а, 2 этаж; 2 корпус': (51.180598, 71.40711),
    'Сауран, 20/1, 2 этаж': (51.111828, 71.418486),
    'Ыбырай Алтынсарин, 12, 2 этаж': (51.191022, 71.413618),
    'Ақмешіт, 5/1, 2 этаж': (51.119041, 71.42263),
    'Жанкент, 23': (51.139367, 71.507267),
    'Кравцова, 2/3, 2 этаж': (51.156544, 71.439968),
    'Әлихан Бөкейхан, 4/1, 2 этаж': (51.118588, 71.438712),
    'Мәңгілік Ел проспект, 82, 3 этаж': (51.069888, 71.421181),
    'Алматы, 13/1, 2 этаж': (51.117505, 71.431305),
    'Александр Герцен, 84/1, 2 этаж': (51.198014, 71.366194),
    'Желтоксан, 31, 2 этаж': (51.174327, 71.413361),
    'Темірбек Жүргенов, 30/1, 3 этаж': (51.12401, 71.506949),
    'Карасай батыра, 31/1, 2 этаж': (51.198333, 71.389492),
    'Дауылпаз, 1, 2 этаж': (51.130598, 71.463349),
    'Қыз Жібек, 40а, 2 этаж': (51.143472, 71.387507),
    'Султанмахмуда Торайгырова, 11, 3 этаж': (51.175699, 71.426556),
    'Қаныш Сәтбаев, 8/1, 2 этаж': (51.154849, 71.465843),
    'ықылас Дүкенұлы, 32, 2 этаж': (51.180018, 71.432283),
    'ықылас Дүкенұлы, 18, 2 этаж': (51.179168, 71.426459),
    'Ак-булак-2, 11, 2 этаж': (51.145506, 71.447149),
    'Щорса, 37, 1-3 этаж': (51.173293, 71.399793),
    'Е 12, 4, 2 этаж': (51.127915, 71.377335),
    'Тұмар ханым, 24, 2 этаж': (51.143464, 71.393534),
    'Е 12, 6, 2 этаж': (51.127848, 71.37821),
    '61-й проезд, 6/1, 2 этаж': (51.043337, 71.432713),
    '25-я, 10/1, 2 этаж': (51.103019, 71.426455),
    'Жұбан ана, 10, 3 этаж': (51.145166, 71.402482),
    'Желтоксан, 28/1, 2 этаж': (51.174365, 71.41504),
    'Шертер, 5, 3 этаж': (51.132251, 71.46436),
    'Гейдар Әлиев, 2/4, 3 этаж': (51.150109, 71.451229),
    'Мағжан Жұмабаев проспект, 1/1, 2 этаж': (51.154971, 71.476235),
    'А 195, 1, 2 этаж': (51.12893, 71.492398),
    'Ақмешіт, 5/2, 2 этаж': (51.117742, 71.422364),
    'Сарыарқа проспект, 50': (51.180336, 71.405539),
    'Қыз Жібек, 30, 2 этаж': (51.141143, 71.391383),
    'Шәймерден Қосшығұлұлы, 13/3, 2 этаж': (51.167473, 71.386169),
    'Петрова, 17/1, 2 этаж; 2 корпус': (51.15079, 71.471225),
    'Республики проспект, 21/1, 4 этаж': (51.163725, 71.426343),
    'генерал Сабыр Рақымов, 33, 2 этаж': (51.165315, 71.437042),
    'Мәскеу, 29/4, 2 этаж; 1 корпус': (51.18316, 71.406273),
    'Тәуелсіздік проспект, 14/3, 2 этаж': (51.147894, 71.462027),
    'Кенен Әзірбаев, 12/1, 2 этаж': (51.125166, 71.498664),
    'Алматы, 4, 2 этаж': (51.117197, 71.415198),
    'Мухтара Ауэзова, 43/2, 2 этаж': (51.180811, 71.418732),
    'Біржан сал, 6/1, 2 этаж': (51.192332, 71.409419),
    'Керей, Жәнібек хандар, 30': (51.111364, 71.437407),
    'Айнакөл, 66/1, 2 этаж': (51.128703, 71.488754),
    'микрорайон Жагалау, 3, 2 этаж': (51.135322, 71.36591),
    'Петрова, 7/2, 2 этаж': (51.150206, 71.465366),
    'Карасай батыра, 3, 2 этаж': (51.195062, 71.402013),
    'Әліби Жангелдин, 15, 2 этаж': (51.174232, 71.420896),
    'Күйші Дина, 38/1, 2 этаж': (51.155232, 71.491779),
    'Қобыз, 32/1, 2 этаж': (51.134456, 71.519124),
    'Қайрат Рысқұлбеков, 8/3, 2 этаж': (51.15475, 71.500761),
    'Тулкибас, 58': (51.143324, 71.495592),
    'Темірбек Жүргенов, 18/2': (51.114076, 71.502729),
    'Кенжебек Күмісбеков, 12/1, 2 этаж': (51.170425, 71.400108),
    'Бурабай, 40, 2 этаж': (51.151525, 71.518474),
    '187-я, 20/6, 2 этаж': (51.173084, 71.382674)
    }

kindergartens_coord_dict = {
    'Ул. Косалка, д. 28': (51.140075, 71.485026),
    'Пр-кт Туран, д. 14': (51.142663, 71.412659),
    'Ул. Ыбрая Алтынсарина, д. 12': (51.191022, 71.413618),
    'Ул. Кенена Азербаева, д. 41': (51.12692, 71.496183),
    'Пр-кт Богенбай батыра, д. 32, корп. 2': (51.174351, 71.40896),
    'Пр-кт Богенбай батыра, д. 19, корп. 2': (51.17633, 71.401737),
    'Ул. Ыкылас Дукенулы, д. 32': (51.180018, 71.432283),
    'Ул. Жангельдина, д. 1': (51.173111, 71.408391),
    'Ул. Сабира Рахимова, д. 22': (51.162188, 71.439184),
    'Пр-кт Абая, д. 95/1': (51.167307, 71.462254),
    'Ул. Косалка, д. 24': (51.139862, 71.484219),
    'Ул. А 195, д. 1': (51.12893, 71.492398),
    'Ул. Карасай батыра, д. 3': (51.195062, 71.402013),
    'Ул. Романтиков, д. 21': (51.144392, 71.454628),
    'Ул. Желтоксан, д. 48': (51.180711, 71.412639),
    'Ул. Александра Затаевича, д. 16, корп. 1': (51.190502, 71.404555),
    'Ул. Коксай, д. 1, корп. 1': (51.110487, 71.217157),
    'Ул. Челюскинцев, д. 90': (51.167854, 71.406261),
    'пр-кт Абылай Хана, д. 8, корп. 1': (51.158037, 71.472773),
    'ул. Габдуллина, д. 8': (51.160025, 71.433806),
    'ул. Шонанулы, д. 45': (51.195977, 71.431179),
    'ул. Акмолинская, д. 3': (51.109965, 71.216906),
    'ул. Халел Досмухамедулы, д. 33': (51.141212, 71.422396),
    'ул. Жумабека Ташенова, д. 21, корп. 1': (51.154217, 71.448859),
    'ул. Айман-Шолпан, д. 13': (51.140398, 71.402021),
    'ул. Кокарал, д. 12': (51.1317, 71.525029),
    'ул. Желтоксан, д. 31': (51.174327, 71.413361),
    'ул. Куйши Дина, д. 31': (51.152313, 71.485413),
    'ул. Алматы, д. 6': (51.116412, 71.4212),
    'ул. Иманжусипа Кутпанова, д. 16/а': (51.191849, 71.415625),
    'ул. Карасай батыра, д. 31, корп. 1': (51.198333, 71.389492),
    'ул. Конституции, д. 40': (51.195784, 71.393903),
    'ул. Лепсы, д. 59': (51.149147, 71.525912),
    'пр-кт Шакарима Кудайбердиулы, д. 2, корп. 1': (51.163039, 71.475435),
    'ул. Бейимбет Майлина, д. 16, корп. 3': (51.144977, 71.475581),
    'ул. Желтоксан, д. 28, корп. 1': (51.174365, 71.41504),
    'пр-кт Магжана Жумабаева, д. 1, корп. 1': (51.154971, 71.476235),
    'аул Караоткель, ул. Мустафа Шокай, д. 7': (51.123356, 71.217755),
    'ул. Кенжебека Кумисбекова, д. 12, корп. 1': (51.170425, 71.400108),
    'ул. Брусиловского, д. 4, корп. 3': (51.160311, 71.456362),
    'пр-кт Мангилик Ел, д. 22, корп. 2': (51.11408, 71.436805),
    'ул. Московская, д. 38': (51.182142, 71.418538),
    'ул. Герцена, д. 84': (51.198014, 71.366194),
    'ул. Жангельдина, д. 15': (51.174232, 71.420896),
    'ул. Петрова, д. 3, корп. 1': (51.151764, 71.463992),
    'ул. Московская, д. 28': (51.180598, 71.40711),
    'пр-кт Абылай Хана, д. 28, корп. 1': (51.154045, 71.483381),
    'ул. Шыганак, д. 7': (51.158387, 71.406872),
    'ул. Кошкарбаева, д. 33': (51.165315, 71.437042),
    'пр-кт Бауржана Момышулы, д. 28, корп. 12': (51.146364, 71.5015),
    'ул. Московская, д. 29, корп. 4': (51.18316, 71.406273),
    'ул. Сатпаева, д. 8, корп. 1': (51.151712, 71.470595),
    'ул. Петрова, д. 17, корп. 1': (51.15079, 71.471225),
    'ул. Иманбаевой, д. 16, оф. 57': (51.167922, 71.434146),
    'ул. Шонанулы, д. 47': (51.196118, 71.432177),
    'пер. Басире, д. 2': (51.185095, 71.330193),
    'пр-кт Женис, д. 41, корп. 2': (51.177208, 71.408317),
    'ул. Биржан Сала, д. 6, корп. 1': (51.192332, 71.409419),
    'ул. 187-я, д. 20, корп. 6': (51.173084, 71.382674),
    'ул. Тумар Ханым, д. 24': (51.143464, 71.393534),
    'ул. Кенесары, д. 93, корп. 1': (51.162751, 71.467509),
    'ул. Айнакол, д. 66, корп. 1': (51.128703, 71.488754),
    'пр-кт Тауелсыздык, д. 14, корп. 3': (51.147678, 71.459786),
    'ул. 24-я, д. 20': (51.106277, 71.439497),
    'ул. Камысты, д. 7': (51.199447, 71.454819),
    'ул. 188-я, д. 3, корп. 1': (51.167308, 71.392195),
    'ул. 247-я, д. 2': (51.112273, 71.649066),
    'ул. Кеменгерулы, д. 10': (51.206258, 71.397518),
    'ул. Жангельдина, д. 28': (51.173492, 71.421442),
    'ул. Александра Кравцова, д. 2, корп. 3': (51.156544, 71.439968),
    'пер. Минский, д. 4': (51.164955, 71.463493),
    'ул. Маяковского, д. 3, корп. 2': (51.145683, 71.56385),
    'ул. 188-я, д. 13, корп. 3': (51.167473, 71.386169),
    'пр-кт Республики, д. 21, корп. 1': (51.163725, 71.426343),
    'ул. Айдархана Турлыбаева, д. 13': (51.181694, 71.367934),
    'ул. Кайрата Рыскулбекова, д. 8': (51.155506, 71.498814),
    'ул. 167-я, д. 5, корп. 1': (51.10991, 71.217742),
    'ул. Ыкылас Дукенулы, д. 32': (51.180018, 71.432283),
    'пр-кт Богенбай батыра, д. 32, корп. 2': (51.174351, 71.40896),
    'ул. Дауылпаз, д. 1': (51.130598, 71.463349),
    'ул. Ардагерлер, д. 13': (51.182051, 71.341128)
    }



#############################################################################
# Functions for calculating or checking places based on complex coordinates #
#############################################################################
# Counting the number of nearby places
def count_places_within_radius(places_dict, complex_coordinates, radius=1000):
    '''
    Counts the number of places (schools or kindergartens) within a specified radius from a given complex location.

    Arguments:
        - places_dict (str): A string indicating the type of places to count. It should be either 'school' or 'kindergarten'.
        - complex_coordinates (tuple): A tuple containing the latitude and longitude coordinates of the complex location.
        - radius (float): The radius within which to search for places, in meters.

    Returns:
        int: The count of places (schools or kindergartens) within the specified radius from the complex location.

    Raises:
        ValueError: If the places_dict argument is not 'school' or 'kindergarten'.
    '''
    
    if places_dict == 'school':
        places_dict = schools_coord_dict
                
    elif places_dict == 'kindergarten':
        places_dict = kindergartens_coord_dict
            
    else:
        raise ValueError("Invalid places_dict argument. It should be 'school' or 'kindergarten'.")

    count = 0
    for place_coordinates in places_dict.values():
        distance = geodesic(complex_coordinates, place_coordinates).meters
        if distance <= radius:
            count += 1
    
    return count


# Checking if there is a park within 1 km radius
def checking_park(coordinates, radius=2000):
    '''
    Checks if there is a park within a specified radius from the given coordinates.

    Arguments:
        - coordinates (tuple): A tuple containing the latitude and longitude coordinates.
        - radius (float): The radius within which to search for parks, in meters.

    Returns:
        bool: True if there is a park within the specified radius, False otherwise.
    '''
    
    parks_coord_dict = {
    'Парк Президентский': (51.106349, 71.477572),
    'Парк Ғашықтар': (51.131764, 71.409002),
    'Парк им. Б. Момышулы': (51.131779, 71.456687),
    'Парк Времена года': (51.15173, 71.432224),
    'Триатлон Парк Астана': (51.13593, 71.449809),
    'Центральный парк культуры и отдыха «Столичный»': (51.156264, 71.419961),
    'Парк Арай': (51.134873, 71.437905),
    'Сквер Президентский': (51.166511, 71.417352),
    'Парк Жеруйык': (51.146082, 71.488548),
    'Шахматный парк': (51.164953, 71.42666),
    'Парк им. Ж. Жабаева': (51.151498, 71.445536),
    'Парк Студенческий': (51.155554, 71.46258),
    'Парк Пушкинский': (51.159982, 71.470155),
    'Парк Афганской войны': (51.157236, 71.477074),
    'Площадь Городская': (51.165511, 71.421089),
    'Площадь Защитников Отечества': (51.153045, 71.457329)
    }

    for park_coordinates in parks_coord_dict.values():
        distance = geodesic(coordinates, park_coordinates).meters
        if distance <= radius:
            return True
        
    return False  


